commands_templates/CreateCertificate0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/device/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:CreateCertificate>
         <!--Optional:-->
         <!--type: token-->
         <wsdl:CertificateID>?</wsdl:CertificateID>
         <!--Optional:-->
         <!--type: string-->
         <wsdl:Subject>?</wsdl:Subject>
         <!--Optional:-->
         <!--type: dateTime-->
         <wsdl:ValidNotBefore>?</wsdl:ValidNotBefore>
         <!--Optional:-->
         <!--type: dateTime-->
         <wsdl:ValidNotAfter>?</wsdl:ValidNotAfter>
      </wsdl:CreateCertificate>
   </soap:Body>
</soap:Envelope>